OpenFOAM/simpleFsi-OFv2112/cases/test-helloWorld/system/helloWorld
helloWorld1
{
    type        helloWorld;
    
    libs ( "libforces.so" "libhelloWorldFunctionObject.so" );
        
    writeControl   timeStep;
    timeInterval    1;  //must be 1
    
    log         yes;

    //from libforces
    patches     ( cylinder );
    rho         rhoInf;      // Indicates incompressible
    rhoInf      1000;        // Redundant for incompressible
    CofR        (0 0 0);     // Reference point for torque computation 
    
}

